name: "FCN"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 480
input_dim: 854

layer { bottom: 'data' top: 'conv1_1' name: 'conv1_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_1' top: 'conv1_1' name: 'relu1_1' type: "ReLU" }
layer { bottom: 'conv1_1' top: 'conv1_2' name: 'conv1_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_2' top: 'conv1_2' name: 'relu1_2' type: "ReLU" }
layer { name: 'pool1' bottom: 'conv1_2' top: 'pool1' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: 'conv2_1' bottom: 'pool1' top: 'conv2_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_1' top: 'conv2_1' name: 'relu2_1' type: "ReLU" }
layer { bottom: 'conv2_1' top: 'conv2_2' name: 'conv2_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_2' top: 'conv2_2' name: 'relu2_2' type: "ReLU" }
layer { bottom: 'conv2_2' top: 'pool2' name: 'pool2' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool2' top: 'conv3_1' name: 'conv3_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_1' top: 'conv3_1' name: 'relu3_1' type: "ReLU" }
layer { bottom: 'conv3_1' top: 'conv3_2' name: 'conv3_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_2' top: 'conv3_2' name: 'relu3_2' type: "ReLU" }
layer { bottom: 'conv3_2' top: 'conv3_3' name: 'conv3_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_3' top: 'conv3_3' name: 'relu3_3' type: "ReLU" }
layer { bottom: 'conv3_3' top: 'pool3' name: 'pool3' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool3' top: 'conv4_1' name: 'conv4_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_1' top: 'conv4_1' name: 'relu4_1' type: "ReLU" }
layer { bottom: 'conv4_1' top: 'conv4_2' name: 'conv4_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_2' top: 'conv4_2' name: 'relu4_2' type: "ReLU" }
layer { bottom: 'conv4_2' top: 'conv4_3' name: 'conv4_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_3' top: 'conv4_3' name: 'relu4_3' type: "ReLU" }
layer { bottom: 'conv4_3' top: 'pool4' name: 'pool4' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool4' top: 'conv5_1' name: 'conv5_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_1' top: 'conv5_1' name: 'relu5_1' type: "ReLU" }
layer { bottom: 'conv5_1' top: 'conv5_2' name: 'conv5_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_2' top: 'conv5_2' name: 'relu5_2' type: "ReLU" }
layer { bottom: 'conv5_2' top: 'conv5_3' name: 'conv5_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_3' top: 'conv5_3' name: 'relu5_3' type: "ReLU" }

## Prep 2
layer { bottom: 'conv2_2' top: 'conv2_2_16' name: 'conv2_2_16' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 3
layer { bottom: 'conv3_3' top: 'conv3_3_16' name: 'conv3_3_16' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 4
layer { bottom: 'conv4_3' top: 'conv4_3_16' name: 'conv4_3_16' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 5
layer { bottom: 'conv5_3' top: 'conv5_3_16' name: 'conv5_3_16' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }

### Multiple conv 2 ###
layer { type: "Deconvolution" name: 'upsample2_' bottom: 'conv2_2_16' top: 'side-multi2-up'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 16 pad: 1} }
layer { type: "Crop" name: 'crop2' bottom: 'side-multi2-up' bottom: 'data' top: 'upside-multi2' }

### Multiple conv 3 ###
layer { type: "Deconvolution" name: 'upsample4_' bottom: 'conv3_3_16' top: 'side-multi3-up'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 8 stride: 4 num_output: 16 } }
layer { type: "Crop" name: 'crop3' bottom: 'side-multi3-up' bottom: 'data' top: 'upside-multi3' crop_param { axis: 2 offset: 2 offset: 2 }}

### Multiple conv 4 ###
layer { type: "Deconvolution" name: 'upsample8_' bottom: 'conv4_3_16' top: 'side-multi4-up'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 16 stride: 8 num_output: 16 } }
layer { type: "Crop" name: 'crop4' bottom: 'side-multi4-up' bottom: 'data' top: 'upside-multi4' crop_param { axis: 2 offset: 4 offset: 4 }}

### Multiple conv 5 ###
layer { type: "Deconvolution" name: 'upsample16_' bottom: 'conv5_3_16' top: 'side-multi5-up'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 32 stride: 16 num_output: 16 } }
layer { type: "Crop" name: 'crop5' bottom: 'side-multi5-up' bottom: 'data' top: 'upside-multi5' crop_param { axis: 2 offset: 8 offset: 8 }}

### Concat and multiscale weight layer ###
layer { name: "concat" bottom: "upside-multi2"  bottom: "upside-multi3" bottom: "upside-multi4" bottom: "upside-multi5" top: "concat-upscore" type: "Concat"
  concat_param { concat_dim: 1} }
layer { name: 'new-score-weighting' type: "Convolution" bottom: 'concat-upscore' top: 'upscore-fuse'
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 1 kernel_size: 1 weight_filler {type: "gaussian" std: 0.01} } }
layer { name: "fuse" type: "Sigmoid" bottom: "upscore-fuse" top:"fuse" }


layer { bottom: 'data' top: 'conv1_1_contour' name: 'conv1_1_contour' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_1_contour' top: 'conv1_1_contour' name: 'relu1_1_contour' type: "ReLU" }
layer { bottom: 'conv1_1_contour' top: 'conv1_2_contour' name: 'conv1_2_contour' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_2_contour' top: 'conv1_2_contour' name: 'relu1_2_contour' type: "ReLU" }
layer { name: 'pool1_contour' bottom: 'conv1_2_contour' top: 'pool1_contour' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: 'conv2_1_contour' bottom: 'pool1_contour' top: 'conv2_1_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_1_contour' top: 'conv2_1_contour' name: 'relu2_1_contour' type: "ReLU" }
layer { bottom: 'conv2_1_contour' top: 'conv2_2_contour' name: 'conv2_2_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_2_contour' top: 'conv2_2_contour' name: 'relu2_2_contour' type: "ReLU" }
layer { bottom: 'conv2_2_contour' top: 'pool2_contour' name: 'pool2_contour' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool2_contour' top: 'conv3_1_contour' name: 'conv3_1_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_1_contour' top: 'conv3_1_contour' name: 'relu3_1_contour' type: "ReLU" }
layer { bottom: 'conv3_1_contour' top: 'conv3_2_contour' name: 'conv3_2_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_2_contour' top: 'conv3_2_contour' name: 'relu3_2_contour' type: "ReLU" }
layer { bottom: 'conv3_2_contour' top: 'conv3_3_contour' name: 'conv3_3_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_3_contour' top: 'conv3_3_contour' name: 'relu3_3_contour' type: "ReLU" }
layer { bottom: 'conv3_3_contour' top: 'pool3_contour' name: 'pool3_contour' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool3_contour' top: 'conv4_1_contour' name: 'conv4_1_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_1_contour' top: 'conv4_1_contour' name: 'relu4_1_contour' type: "ReLU" }
layer { bottom: 'conv4_1_contour' top: 'conv4_2_contour' name: 'conv4_2_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_2_contour' top: 'conv4_2_contour' name: 'relu4_2_contour' type: "ReLU" }
layer { bottom: 'conv4_2_contour' top: 'conv4_3_contour' name: 'conv4_3_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_3_contour' top: 'conv4_3_contour' name: 'relu4_3_contour' type: "ReLU" }
layer { bottom: 'conv4_3_contour' top: 'pool4_contour' name: 'pool4_contour' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { bottom: 'pool4_contour' top: 'conv5_1_contour' name: 'conv5_1_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_1_contour' top: 'conv5_1_contour' name: 'relu5_1_contour' type: "ReLU" }
layer { bottom: 'conv5_1_contour' top: 'conv5_2_contour' name: 'conv5_2_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_2_contour' top: 'conv5_2_contour' name: 'relu5_2_contour' type: "ReLU" }
layer { bottom: 'conv5_2_contour' top: 'conv5_3_contour' name: 'conv5_3_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_3_contour' top: 'conv5_3_contour' name: 'relu5_3_contour' type: "ReLU" }

  
## Prep 2 contour
layer { bottom: 'conv2_2_contour' top: 'conv2_2_16_contour' name: 'conv2_2_16_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 3 contour
layer { bottom: 'conv3_3_contour' top: 'conv3_3_16_contour' name: 'conv3_3_16_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 4 contour
layer { bottom: 'conv4_3_contour' top: 'conv4_3_16_contour' name: 'conv4_3_16_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }
  
## Prep 5 contour
layer { bottom: 'conv5_3_contour' top: 'conv5_3_16_contour' name: 'conv5_3_16_contour' type: "Convolution"
  param { lr_mult: 10 decay_mult: 1 } param { lr_mult: 20 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 16 pad: 1 kernel_size: 3 weight_filler{ type: "gaussian" std: 0.001}} }

### Multiple conv 2 contour ###
layer { type: "Deconvolution" name: 'upsample2_contour' bottom: 'conv2_2_16_contour' top: 'side-multi2-up_contour'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 16 pad: 1} }
layer { type: "Crop" name: 'crop2_contour' bottom: 'side-multi2-up_contour' bottom: 'data' top: 'upside-multi2_contour' }

### Multiple conv 3 contour ###
layer { type: "Deconvolution" name: 'upsample4_contour' bottom: 'conv3_3_16_contour' top: 'side-multi3-up_contour'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 8 stride: 4 num_output: 16 } }
layer { type: "Crop" name: 'crop3_contour' bottom: 'side-multi3-up_contour' bottom: 'data' top: 'upside-multi3_contour'  crop_param { axis: 2 offset: 2 offset: 2 }}

### Multiple conv 4 contour ###
layer { type: "Deconvolution" name: 'upsample8_contour' bottom: 'conv4_3_16_contour' top: 'side-multi4-up_contour'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 16 stride: 8 num_output: 16 } }
layer { type: "Crop" name: 'crop4_contour' bottom: 'side-multi4-up_contour' bottom: 'data' top: 'upside-multi4_contour'  crop_param { axis: 2 offset: 4 offset: 4 }}

### Multiple conv 5 contour ###
layer { type: "Deconvolution" name: 'upsample16_contour' bottom: 'conv5_3_16_contour' top: 'side-multi5-up_contour'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 32 stride: 16 num_output: 16 } }
layer { type: "Crop" name: 'crop5_contour' bottom: 'side-multi5-up_contour' bottom: 'data' top: 'upside-multi5_contour'  crop_param { axis: 2 offset: 8 offset: 8 }}

### Concat and multiscale weight layer contour ###
layer { name: "concat_contour" bottom: "upside-multi2_contour"  bottom: "upside-multi3_contour" bottom: "upside-multi4_contour" bottom: "upside-multi5_contour" top: "concat-upscore_contour" type: "Concat"
  concat_param { concat_dim: 1} }
layer { name: 'new-score-weighting_contour' type: "Convolution" bottom: 'concat-upscore_contour' top: 'upscore-fuse_contour'
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 1 kernel_size: 1 weight_filler {type: "gaussian" std: 0.001} } }
  layer { name: "fuse_contour" type: "Sigmoid" bottom: "upscore-fuse_contour" top:"fuse_contour" }

